Autodesk.Revit.DB.Analysis.HVACLoadLoadsReportType
Enumerated type listing possible types of reports generated for HVAC loads.
Since:
2011

Autodesk.Revit.DB.Analysis.HVACLoadLoadsReportType.DetailedReport
A detailed report including orientation breakdowns

Autodesk.Revit.DB.Analysis.HVACLoadLoadsReportType.StandardReport
A standard report including zones and spaces

Autodesk.Revit.DB.Analysis.HVACLoadLoadsReportType.SimpleReport
A simple report with summaries

Autodesk.Revit.DB.Analysis.HVACLoadLoadsReportType.NoReport
No report